tutorials/buoyantPbePimpleFoam/TaylorCouette/constant/populationBalanceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      populationaBalanceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

populationBalanceModel univariatePopulationBalance;

univariatePopulationBalanceCoeffs
{
    aggregation on;

    aggregationKernel
    {
        aggregationKernel turbulentBrownian;
    }

    breakup off;

    breakupKernel
    {
        breakupKernel constant;

        Cb        Cb        [ 0 0 0 0 0 0 0 ] 6.0e-4;
        epsilonExp          0.75;
        nuExp              -1.25;
        sizeExp             1.0;
    }

    daughterDistribution
    {
        daughterDistribution symmetricFragmentation;
    }

    diffusionModel
    {
        diffusionModel  turbulentDiffusion;
        gammaLam        gammaLam    [ 0 2 -1 0 0 0 0 ] 0.0001;
        Sc              0.7;
    }

    growth off;

    growthModel
    {
        growthModel constant;

        Cg        Cg        [0 3 -1 0 0 0 0 ] 1.0;
    }
}





// ************************************************************************* //
